# Keep sorted: cat Brewfile|sort|sponge Brewfile
brew 'autojump' # cd (already configured with my dotfiles)
brew 'bat' # cat
brew 'coreutils' # GNU coreutils such as date, sed... (set as default in dotfiles)
brew 'diff-so-fancy' # diff (set for git)
brew 'fd' # find
brew 'gifski' # high quality gifs
brew 'help2man'
brew 'hexyl' # hexdump
brew 'httpie' # curl
brew 'jq' # json utility, use jj if you need to go faster
brew 'openssl'
brew 'parallel'
brew 'qrencode'
brew 'ripgrep' # grep (`rg` in the command line, aliased with some customization)
brew 'spark' # spark 1 2 3 4 => ▁▃▅█
brew 'sponge' # slurp all stdin before continuing (cat somefile | tr -d ' ' | sponge somefile)
brew 'terminal-notifier'
brew 'tree'
brew 'youtube-dl'
