# Keep sorted: p|sort|c
brew 'autojump' # cd (already configured with my dotfiles)
brew 'bat' # cat
brew 'cloc' # count lines of code
brew 'coreutils' # GNU coreutils such as date, sed... (set as default in dotfiles)
brew 'diff-so-fancy' # diff (set for git)
brew 'difftastic' # diff (not just fancy but smart)
brew 'duf' # df
brew 'exa' # ls
brew 'fd' # find
brew 'ffmpeg'
brew 'gifski' # high quality gifs
brew 'git-delta'
brew 'help2man'
brew 'hexyl' # hexdump
brew 'httpie' # curl
brew 'hyperfine'
brew 'jq' # json utility, use jj if you need to go faster
#NOT brew 'ngrok', but http://localhost.run/
brew 'openssl'
brew 'parallel'
brew 'pgcli' # psql
brew 'qrencode'
brew 'ripgrep' # grep (`rg` in the command line, aliased with some customization)
brew 'spark' # spark 1 2 3 4 => ▁▃▅█
brew 'rename' # rename -s super_duper stack_loop
brew 'sponge' # slurp all stdin before continuing (cat somefile | tr -d ' ' | sponge somefile)
brew 'tealdeer' # Fast tldr
brew 'terminal-notifier'
brew 'tree'
brew 'visual-studio-code'
brew 'youtube-dl'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono' # if you don't have https://monolisa.dev
